Autodesk.Revit.DB.Structure.RebarContainerItem.SetFromCurvesAndShape(Autodesk.Revit.DB.Structure.RebarShape,Autodesk.Revit.DB.Structure.RebarBarType,Autodesk.Revit.DB.Structure.RebarHookType,Autodesk.Revit.DB.Structure.RebarHookType,Autodesk.Revit.DB.XYZ,System.Collections.Generic.IList`1{Autodesk.Revit.DB.Curve},Autodesk.Revit.DB.Structure.RebarHookOrientation,Autodesk.Revit.DB.Structure.RebarHookOrientation)
Set an instance of a RebarContainerItem element according to the parameters list.
The instance will have the default shape parameters from the RebarShape.
If the RebarShapeDefinesHooks flag in ReinforcementSettings has been set to true,
then both the curves and hooks must match the RebarShape definition.
Otherwise, the hooks can be different than the defaults specified in the RebarShape
rebarShape:
A RebarShape element that defines the shape of the rebar.
A RebarShape element matches curves and hooks.
A RebarShape element provides RebarStyle of the rebar.
barType:
A RebarBarType element that defines bar diameter, bend radius and material of the rebar.
startHook:
A RebarHookType element that defines the hook for the start of the bar.
If this parameter is null, it means to create a rebar with no hook.
endHook:
A RebarHookType element that defines the hook for the end of the bar.
If this parameter is null, it means to create a rebar with no hook.
norm:
The normal to the plane that the rebar curves lie on.
curves:
An array of curves that define the shape of the rebar curves.
They must belong to the plane defined by the normal and origin.
Bends and hooks should not be included in the array of curves.
startHookOrient:
Defines the orientation of the hook plane at the start of the rebar with respect to the orientation of the first curve and the plane normal.
Only two values are permitted:
Value = Right: The hook is on your right as you stand at the end of the bar,
with the bar behind you, taking the bar's normal as "up."
Value = Left: The hook is on your left as you stand at the end of the bar,
with the bar behind you, taking the bar's normal as "up."
endHookOrient:
Defines the orientation of the hook plane at the end of the rebar with respect to the orientation of the last curve and the plane normal.
Only two values are permitted:
Value = Right: The hook is on your right as you stand at the end of the bar,
with the bar behind you, taking the bar's normal as "up."
Value = Left: The hook is on your left as you stand at the end of the bar,
with the bar behind you, taking the bar's normal as "up."
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input curves is empty.
-or-
The input curves contains at least one curve which is not a bound Line or bound Arc
and is not supported for this operation.
-or-
curves do not form a valid CurveLoop.
-or-
The input curves contains at least one helical curve and is not supported for this operation.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
norm has zero length.
-or-
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException:
curves contains non-fillet arcs with radii that are less than the
minimum bend radius for the RebarBarType and RebarShape style.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
rebarShape does not match curves.
Since:
2016

Autodesk.Revit.DB.Structure.RebarContainerItem.SetFromRebarShape(Autodesk.Revit.DB.Structure.RebarShape,Autodesk.Revit.DB.Structure.RebarBarType,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ)
Set an instance of a RebarContainerItem element, as an instance of a RebarShape.
The instance will have the default shape parameters from the RebarShape,
and its location is based on the bounding box of the shape in the shape definition.
Hooks are removed from the shape before computing its bounding box.
If appropriate hooks can be found in the document, they will be assigned arbitrarily.
rebarShape:
A RebarShape element that defines the shape of the rebar.
barType:
A RebarBarType element that defines bar diameter, bend radius and material of the rebar.
origin:
The lower-left corner of the shape's bounding box will be placed at this point in the project.
xVec:
The x-axis in the shape definition will be mapped to this direction in the project.
yVec:
The y-axis in the shape definition will be mapped to this direction in the project.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
xVec has zero length.
-or-
yVec has zero length.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Since:
2016

Autodesk.Revit.DB.Structure.RebarContainerItem.SetFromCurves(Autodesk.Revit.DB.Structure.RebarStyle,Autodesk.Revit.DB.Structure.RebarBarType,Autodesk.Revit.DB.Structure.RebarHookType,Autodesk.Revit.DB.Structure.RebarHookType,Autodesk.Revit.DB.XYZ,System.Collections.Generic.IList`1{Autodesk.Revit.DB.Curve},Autodesk.Revit.DB.Structure.RebarHookOrientation,Autodesk.Revit.DB.Structure.RebarHookOrientation,System.Boolean,System.Boolean)
Set an instance of a RebarContainerItem element according to the parameters list.
style:
The usage of the bar, "standard" or "stirrup/tie".
barType:
A RebarBarType element that defines bar diameter, bend radius and material of the rebar.
startHook:
A RebarHookType element that defines the hook for the start of the bar.
If this parameter is null, it means to create a rebar with no hook.
endHook:
A RebarHookType element that defines the hook for the end of the bar.
If this parameter is null, it means to create a rebar with no hook.
norm:
The normal to the plane that the rebar curves lie on.
curves:
An array of curves that define the shape of the rebar curves.
They must belong to the plane defined by the normal and origin.
Bends and hooks should not be included in the array of curves.
startHookOrient:
Defines the orientation of the hook plane at the start of the rebar with respect to the orientation of the first curve and the plane normal.
Only two values are permitted:
Value = Right: The hook is on your right as you stand at the end of the bar,
with the bar behind you, taking the bar's normal as "up."
Value = Left: The hook is on your left as you stand at the end of the bar,
with the bar behind you, taking the bar's normal as "up."
endHookOrient:
Defines the orientation of the hook plane at the end of the rebar with respect to the orientation of the last curve and the plane normal.
Only two values are permitted:
Value = Right: The hook is on your right as you stand at the end of the bar,
with the bar behind you, taking the bar's normal as "up."
Value = Left: The hook is on your left as you stand at the end of the bar,
with the bar behind you, taking the bar's normal as "up."
useExistingShapeIfPossible:
Attempts to assign a RebarShape from those existing in the document. If no shape matches, NewRebar returns  or creates a new shape, according to the parameter createNewShape.
When both parameters are "true", the behavior is the same as sketching rebar in the UI. At least one of these parameters must be "true".
If the RebarShapeDefinesHooks flag in ReinforcementSettings has been set to false, and a RebarShape cannot be found with both matching curves and hooks,
then this method will perform a second search, ignoring hook information.
createNewShape:
Creates a shape in the document to match the curves, hooks, and style specified, and assigns it to the new rebar instance.
Shape creation will not succeed unless one or more other shapes already exist in the document, and these shapes
have enough shape parameters to define a shape for these curves.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input curves is empty.
-or-
The input curves contains at least one curve which is not a bound Line or bound Arc
and is not supported for this operation.
-or-
curves do not form a valid CurveLoop.
-or-
The input curves contains at least one helical curve and is not supported for this operation.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
norm has zero length.
-or-
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException:
Both useExistingShapeIfPossible and createNewShape are false.
-or-
curves contains non-fillet arcs with radii that are less than the
minimum bend radius for the RebarBarType and bar style.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Since:
2016

Autodesk.Revit.DB.Structure.RebarContainerItem.SetFromRebar(Autodesk.Revit.DB.Structure.Rebar)
Set an instance of a RebarContainerItem element according to a Rebar parameters.
rebar:
The Rebar.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Since:
2016

Autodesk.Revit.DB.Structure.RebarContainerItem.RebarShapeId
The RebarShape element that defines the shape of the rebar.
Remarks:
Changing the value of this property causes the Rebar instance to choose values for its
shape parameters to preserve its previous shape as closely as possible
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: shapeId is not the id of a RebarShape in the document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
When setting this property: None of the following disciplines is enabled: Structural.
Since:
2016